netflux_db_api/app/controllers/tiers_controller.rb

SELECT "tiers".* FROM "tiers"
---
    def index
        @tiers = Tier.all

SELECT  "tiers".* FROM "tiers" WHERE "tiers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def getUsers
        @tier = Tier.find(params[:tier_id])